abisheksethu/UCOS_EDF_SRP/ce4053/Micrium/Software/EvalBoards/TI/LM3S9B92-EVALBOT/IAR/uCOS-III-CE4053_PG/OS_RecTask.c
/*
*********************************************************************************************************
*                                              TASK RECURSION CODE
*
*               All rights reserved.  Protected by international copyright laws.
*               Knowledge of the source code may NOT be used to develop a similar product.
*               Please help us continue to provide the Embedded community with the finest
*               software available.  Your honesty is greatly appreciated.
*********************************************************************************************************
*/
/*
*********************************************************************************************************
*
*                                            TASK RECURSION CODE
*
* Filename      : OS_RecTask.c
* Version       : V1.00
* Programmer(s) : Team Tesla
*
*********************************************************************************************************
*/
/*
*********************************************************************************************************
*                                             INCLUDE FILES
*********************************************************************************************************
*/

#include <includes.h>
#include <stdio.h>
#include "driverlib/timer.h"
#include "inc/hw_memmap.h"
#include "inc/hw_types.h"
#include <os.h>

/*
*********************************************************************************************************
*                                            GLOBAL VARIABLES
*********************************************************************************************************
*/
static CPU_INT32U  counter;
extern Tree * RecursionTree;
extern Tree * SchedulerTree;
extern HEAP * HEAP1;
extern Tree * SchedulerTree;

/*OVERHEAD CALCULATION*/
extern CPU_TS StartTime;
extern CPU_TS StartTime2;
CPU_TS OverheadValue;
/*
*********************************************************************************************************
*                                         FUNCTION PROTOTYPES
*********************************************************************************************************
*/

/*
*********************************************************************************************************
*                                          CREATE RECURSIVE TASKs
*
* Description : This function is called by Timer0A interrupt handler. Based on the task set registered 
*               in the datastructure, it will create a new task with respective to its release time
*
* Arguments   : none
*
* Returns     : none
*
* Notes       :
*               
*********************************************************************************************************
*/

void  OSTaskHandler (void)
{ 
  CPU_INT32U rel_time = 0;
  CPU_INT32U entry = 0;
  CPU_INT32U abs_deadline = 0;
  Tree *min;
  
  /*--------------- FIND MINIMUM TASK RELEASE TIME -------*/    
  min = GetMinRecTree(RecursionTree);
  /**************check if the counter value equals the minimum relese time value***********/
  if( min->release_time == counter )
  { 
    entry = min->entries;
    for(int i=0; (i < entry && i < NUM_OF_TASKS); i++)
    {
      if(min->p_tcb[i]!= NULL)
      { 
        /* --------------- RESET TCB STACK -------*/
        OSTCBStackReset(min->p_tcb[i]);
        /* ---------------THEN UPDATE ABSOlUTE RELEASE PERIOD AND ABSOLUTE DEADLINE FOR THE TASK -------*/
        rel_time = CounterOverflow(counter + (min->p_tcb[i]->TaskPeriod));
        abs_deadline = CounterOverflow(counter + (min->p_tcb[i]->TaskDeadline));
        min->p_tcb[i]->TaskRelPeriod = rel_time;
        min->p_tcb[i]->TaskAbsDeadline = abs_deadline;
        /* --------------- ADD TASK TO RECURSION LIST WITH THE UPDATED RELEASE AND DEADLINE PERIOD-------*/
        RecursionTree = InsertRecTree(rel_time, RecursionTree, min->p_tcb[i]);   
        /* --------------- ADD TASK TO SCHEDULING LIST -------*/
#if BINOMIAL_DEBUG
        heap_node_create(min->p_tcb[i],abs_deadline);
#endif
#if EDF_DEBUG
        SchedulerTree = InsertEDFTree(abs_deadline,SchedulerTree,min->p_tcb[i]);
#endif
      }
      else
      {
        /* Update the local counter and boundary check */
        counter = CounterOverflow((counter+1));
        return ;
      }
    }
    /* --------------- REMOVE TCB FROM TASK RECURSION LIST -------*/
    RecursionTree = DelRecTree(min->release_time, RecursionTree);
    OSSched();
  }
  /* Update the local counter and boundary check */
  counter = CounterOverflow((counter+1));
}
/*
*********************************************************************************************************
*                                          RESET STACK FOR NEW TASK
*
* Description : Reset TCB stack and initialise to top of the stack
*              
*
* Arguments   : tcb
*
* Returns     : none
*
* Notes       :
*               
*********************************************************************************************************
*/
void OSTCBStackReset(OS_TCB *p_tcb) 
{
    CPU_STK *p_sp;
    CPU_STK_SIZE  i;
    
    /* --------------- CLEAR THE TASK'S STACK --------------- */
    if ((p_tcb->Opt & OS_OPT_TASK_STK_CHK) != (OS_OPT)0) {         /* See if stack checking has been enabled                 */
      if ((p_tcb->Opt & OS_OPT_TASK_STK_CLR) != (OS_OPT)0) {     /* See if stack needs to be cleared                       */
        p_sp = p_tcb->StkBasePtr;
        for (i = 0u; i < p_tcb->StkSize; i++) {               /* Stack grows from HIGH to LOW memory                    */
          *p_sp = (CPU_STK)0;                               /* Clear from bottom of stack and up!                     */
          p_sp++;
        }
      }
    }
    
    p_sp = OSTaskStkInit(p_tcb->TaskEntryAddr,
                         p_tcb->TaskEntryArg,
                         p_tcb->StkBasePtr,
                         p_tcb->StkLimitPtr,
                         p_tcb->StkSize,
                         p_tcb->Opt);
    
    p_tcb->StkPtr    = p_sp;                                /* Save the new top-of-stack pointer      */ 
    p_tcb->TaskState = (OS_STATE)OS_TASK_STATE_RDY;         /* Indicate that the task in READY STATE  */
}

/*$PAGE*/
